; domain
(define (domain logistics)
	(:requirements :strips :typing)
	(:types city - object place - object physobj - object package - physobj vehicle - physobj truck - vehicle airplane - vehicle airport - place location - place)
	(:constants )
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g1_done___ )
		(g2_done___ )
		(g3_done___ )
		(g0_in-city ?x1 - place ?x2 - city)
		(g1_in-city ?x1 - place ?x2 - city)
		(g2_in-city ?x1 - place ?x2 - city)
		(g3_in-city ?x1 - place ?x2 - city)
		(g0_at ?x1 - physobj ?x2 - place)
		(g1_at ?x1 - physobj ?x2 - place)
		(g2_at ?x1 - physobj ?x2 - place)
		(g3_at ?x1 - physobj ?x2 - place)
		(g0_in ?x1 - package ?x2 - vehicle)
		(g1_in ?x1 - package ?x2 - vehicle)
		(g2_in ?x1 - package ?x2 - vehicle)
		(g3_in ?x1 - package ?x2 - vehicle)
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_at obj13 pos22))
	:effect (and (g0_done___ ))
)
(:action mark-done-g1
	:parameters ()
	:precondition (and (split ) (g1_at obj12 pos23))
	:effect (and (g1_done___ ))
)
(:action mark-done-g2
	:parameters ()
	:precondition (and (split ) (g2_at obj13 pos22))
	:effect (and (g2_done___ ))
)
(:action mark-done-g3
	:parameters ()
	:precondition (and (split ) (g3_at obj11 pos21))
	:effect (and (g3_done___ ))
)
(:action gGLOBAL_LOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (unsplit ) (g0_at ?x2 ?x3) (g1_at ?x2 ?x3) (g2_at ?x2 ?x3) (g3_at ?x2 ?x3) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3))
	:effect (and (not (g0_at ?x1 ?x3)) (not (g1_at ?x1 ?x3)) (not (g2_at ?x1 ?x3)) (not (g3_at ?x1 ?x3)) (g0_in ?x1 ?x2) (g1_in ?x1 ?x2) (g2_in ?x1 ?x2) (g3_in ?x1 ?x2) (increase (total-cost ) 1))
)
(:action g0_LOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g0_at ?x2 ?x3) (g0_at ?x1 ?x3) (split ))
	:effect (and (not (g0_at ?x1 ?x3)) (g0_in ?x1 ?x2))
)
(:action g1_LOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g1_at ?x2 ?x3) (g1_at ?x1 ?x3) (split ) (g0_done___ ))
	:effect (and (not (g1_at ?x1 ?x3)) (g1_in ?x1 ?x2))
)
(:action g2_LOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g2_at ?x2 ?x3) (g2_at ?x1 ?x3) (split ) (g1_done___ ))
	:effect (and (not (g2_at ?x1 ?x3)) (g2_in ?x1 ?x2))
)
(:action g3_LOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g3_at ?x2 ?x3) (g3_at ?x1 ?x3) (split ) (g2_done___ ))
	:effect (and (not (g3_at ?x1 ?x3)) (g3_in ?x1 ?x2))
)
(:action gGLOBAL_LOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (unsplit ) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3) (g0_at ?x2 ?x3) (g1_at ?x2 ?x3) (g2_at ?x2 ?x3) (g3_at ?x2 ?x3))
	:effect (and (not (g0_at ?x1 ?x3)) (not (g1_at ?x1 ?x3)) (not (g2_at ?x1 ?x3)) (not (g3_at ?x1 ?x3)) (g0_in ?x1 ?x2) (g1_in ?x1 ?x2) (g2_in ?x1 ?x2) (g3_in ?x1 ?x2) (increase (total-cost ) 1))
)
(:action g0_LOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g0_at ?x1 ?x3) (g0_at ?x2 ?x3) (split ))
	:effect (and (not (g0_at ?x1 ?x3)) (g0_in ?x1 ?x2))
)
(:action g1_LOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g1_at ?x1 ?x3) (g1_at ?x2 ?x3) (split ) (g0_done___ ))
	:effect (and (not (g1_at ?x1 ?x3)) (g1_in ?x1 ?x2))
)
(:action g2_LOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g2_at ?x1 ?x3) (g2_at ?x2 ?x3) (split ) (g1_done___ ))
	:effect (and (not (g2_at ?x1 ?x3)) (g2_in ?x1 ?x2))
)
(:action g3_LOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g3_at ?x1 ?x3) (g3_at ?x2 ?x3) (split ) (g2_done___ ))
	:effect (and (not (g3_at ?x1 ?x3)) (g3_in ?x1 ?x2))
)
(:action gGLOBAL_UNLOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (unsplit ) (g0_at ?x2 ?x3) (g1_at ?x2 ?x3) (g2_at ?x2 ?x3) (g3_at ?x2 ?x3) (g0_in ?x1 ?x2) (g1_in ?x1 ?x2) (g2_in ?x1 ?x2) (g3_in ?x1 ?x2))
	:effect (and (not (g0_in ?x1 ?x2)) (not (g1_in ?x1 ?x2)) (not (g2_in ?x1 ?x2)) (not (g3_in ?x1 ?x2)) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3) (increase (total-cost ) 1))
)
(:action g0_UNLOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g0_at ?x2 ?x3) (g0_in ?x1 ?x2) (split ))
	:effect (and (not (g0_in ?x1 ?x2)) (g0_at ?x1 ?x3))
)
(:action g1_UNLOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g1_at ?x2 ?x3) (g1_in ?x1 ?x2) (split ) (g0_done___ ))
	:effect (and (not (g1_in ?x1 ?x2)) (g1_at ?x1 ?x3))
)
(:action g2_UNLOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g2_at ?x2 ?x3) (g2_in ?x1 ?x2) (split ) (g1_done___ ))
	:effect (and (not (g2_in ?x1 ?x2)) (g2_at ?x1 ?x3))
)
(:action g3_UNLOAD-TRUCK
	:parameters (?x1 - package ?x2 - truck ?x3 - place)
	:precondition (and (g3_at ?x2 ?x3) (g3_in ?x1 ?x2) (split ) (g2_done___ ))
	:effect (and (not (g3_in ?x1 ?x2)) (g3_at ?x1 ?x3))
)
(:action gGLOBAL_UNLOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (unsplit ) (g0_in ?x1 ?x2) (g1_in ?x1 ?x2) (g2_in ?x1 ?x2) (g3_in ?x1 ?x2) (g0_at ?x2 ?x3) (g1_at ?x2 ?x3) (g2_at ?x2 ?x3) (g3_at ?x2 ?x3))
	:effect (and (not (g0_in ?x1 ?x2)) (not (g1_in ?x1 ?x2)) (not (g2_in ?x1 ?x2)) (not (g3_in ?x1 ?x2)) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3) (increase (total-cost ) 1))
)
(:action g0_UNLOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g0_in ?x1 ?x2) (g0_at ?x2 ?x3) (split ))
	:effect (and (not (g0_in ?x1 ?x2)) (g0_at ?x1 ?x3))
)
(:action g1_UNLOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g1_in ?x1 ?x2) (g1_at ?x2 ?x3) (split ) (g0_done___ ))
	:effect (and (not (g1_in ?x1 ?x2)) (g1_at ?x1 ?x3))
)
(:action g2_UNLOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g2_in ?x1 ?x2) (g2_at ?x2 ?x3) (split ) (g1_done___ ))
	:effect (and (not (g2_in ?x1 ?x2)) (g2_at ?x1 ?x3))
)
(:action g3_UNLOAD-AIRPLANE
	:parameters (?x1 - package ?x2 - airplane ?x3 - place)
	:precondition (and (g3_in ?x1 ?x2) (g3_at ?x2 ?x3) (split ) (g2_done___ ))
	:effect (and (not (g3_in ?x1 ?x2)) (g3_at ?x1 ?x3))
)
(:action gGLOBAL_DRIVE-TRUCK
	:parameters (?x1 - truck ?x2 - place ?x3 - place ?x4 - city)
	:precondition (and (unsplit ) (g0_at ?x1 ?x2) (g1_at ?x1 ?x2) (g2_at ?x1 ?x2) (g3_at ?x1 ?x2) (g0_in-city ?x2 ?x4) (g1_in-city ?x2 ?x4) (g2_in-city ?x2 ?x4) (g3_in-city ?x2 ?x4) (g0_in-city ?x3 ?x4) (g1_in-city ?x3 ?x4) (g2_in-city ?x3 ?x4) (g3_in-city ?x3 ?x4))
	:effect (and (not (g0_at ?x1 ?x2)) (not (g1_at ?x1 ?x2)) (not (g2_at ?x1 ?x2)) (not (g3_at ?x1 ?x2)) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3) (increase (total-cost ) 1))
)
(:action g0_DRIVE-TRUCK
	:parameters (?x1 - truck ?x2 - place ?x3 - place ?x4 - city)
	:precondition (and (g0_at ?x1 ?x2) (g0_in-city ?x2 ?x4) (g0_in-city ?x3 ?x4) (split ))
	:effect (and (not (g0_at ?x1 ?x2)) (g0_at ?x1 ?x3))
)
(:action g1_DRIVE-TRUCK
	:parameters (?x1 - truck ?x2 - place ?x3 - place ?x4 - city)
	:precondition (and (g1_at ?x1 ?x2) (g1_in-city ?x2 ?x4) (g1_in-city ?x3 ?x4) (split ) (g0_done___ ))
	:effect (and (not (g1_at ?x1 ?x2)) (g1_at ?x1 ?x3))
)
(:action g2_DRIVE-TRUCK
	:parameters (?x1 - truck ?x2 - place ?x3 - place ?x4 - city)
	:precondition (and (g2_at ?x1 ?x2) (g2_in-city ?x2 ?x4) (g2_in-city ?x3 ?x4) (split ) (g1_done___ ))
	:effect (and (not (g2_at ?x1 ?x2)) (g2_at ?x1 ?x3))
)
(:action g3_DRIVE-TRUCK
	:parameters (?x1 - truck ?x2 - place ?x3 - place ?x4 - city)
	:precondition (and (g3_at ?x1 ?x2) (g3_in-city ?x2 ?x4) (g3_in-city ?x3 ?x4) (split ) (g2_done___ ))
	:effect (and (not (g3_at ?x1 ?x2)) (g3_at ?x1 ?x3))
)
(:action gGLOBAL_FLY-AIRPLANE
	:parameters (?x1 - airplane ?x2 - airport ?x3 - airport)
	:precondition (and (unsplit ) (g0_at ?x1 ?x2) (g1_at ?x1 ?x2) (g2_at ?x1 ?x2) (g3_at ?x1 ?x2))
	:effect (and (not (g0_at ?x1 ?x2)) (not (g1_at ?x1 ?x2)) (not (g2_at ?x1 ?x2)) (not (g3_at ?x1 ?x2)) (g0_at ?x1 ?x3) (g1_at ?x1 ?x3) (g2_at ?x1 ?x3) (g3_at ?x1 ?x3) (increase (total-cost ) 1))
)
(:action g0_FLY-AIRPLANE
	:parameters (?x1 - airplane ?x2 - airport ?x3 - airport)
	:precondition (and (g0_at ?x1 ?x2) (split ))
	:effect (and (not (g0_at ?x1 ?x2)) (g0_at ?x1 ?x3))
)
(:action g1_FLY-AIRPLANE
	:parameters (?x1 - airplane ?x2 - airport ?x3 - airport)
	:precondition (and (g1_at ?x1 ?x2) (split ) (g0_done___ ))
	:effect (and (not (g1_at ?x1 ?x2)) (g1_at ?x1 ?x3))
)
(:action g2_FLY-AIRPLANE
	:parameters (?x1 - airplane ?x2 - airport ?x3 - airport)
	:precondition (and (g2_at ?x1 ?x2) (split ) (g1_done___ ))
	:effect (and (not (g2_at ?x1 ?x2)) (g2_at ?x1 ?x3))
)
(:action g3_FLY-AIRPLANE
	:parameters (?x1 - airplane ?x2 - airport ?x3 - airport)
	:precondition (and (g3_at ?x1 ?x2) (split ) (g2_done___ ))
	:effect (and (not (g3_at ?x1 ?x2)) (g3_at ?x1 ?x3))
)
)

; problem
(define (problem logistics-04-0)
	(:domain logistics)
	(:objects apn1 - airplane apt1 - airport apt2 - airport pos21 - location pos22 - location pos23 - location pos11 - location pos12 - location pos13 - location cit2 - city cit1 - city tru2 - truck tru1 - truck obj23 - package obj22 - package obj21 - package obj13 - package obj12 - package obj11 - package)
	(:init 
		(unsplit )
		(g0_at apn1 apt2)
		(g1_at apn1 apt2)
		(g2_at apn1 apt2)
		(g3_at apn1 apt2)
		(g0_at tru1 pos11)
		(g1_at tru1 pos11)
		(g2_at tru1 pos11)
		(g3_at tru1 pos11)
		(g0_at tru2 pos22)
		(g1_at tru2 pos22)
		(g2_at tru2 pos22)
		(g3_at tru2 pos22)
		(g0_at obj11 pos11)
		(g1_at obj11 pos11)
		(g2_at obj11 pos11)
		(g3_at obj11 pos11)
		(g0_at obj12 pos12)
		(g1_at obj12 pos12)
		(g2_at obj12 pos12)
		(g3_at obj12 pos12)
		(g0_at obj13 pos13)
		(g1_at obj13 pos13)
		(g2_at obj13 pos13)
		(g3_at obj13 pos13)
		(g0_at obj21 pos21)
		(g1_at obj21 pos21)
		(g2_at obj21 pos21)
		(g3_at obj21 pos21)
		(g0_at obj22 pos22)
		(g1_at obj22 pos22)
		(g2_at obj22 pos22)
		(g3_at obj22 pos22)
		(g0_at obj23 pos23)
		(g1_at obj23 pos23)
		(g2_at obj23 pos23)
		(g3_at obj23 pos23)
		(g0_in-city apt1 cit1)
		(g1_in-city apt1 cit1)
		(g2_in-city apt1 cit1)
		(g3_in-city apt1 cit1)
		(g0_in-city pos11 cit1)
		(g1_in-city pos11 cit1)
		(g2_in-city pos11 cit1)
		(g3_in-city pos11 cit1)
		(g0_in-city pos12 cit1)
		(g1_in-city pos12 cit1)
		(g2_in-city pos12 cit1)
		(g3_in-city pos12 cit1)
		(g0_in-city pos13 cit1)
		(g1_in-city pos13 cit1)
		(g2_in-city pos13 cit1)
		(g3_in-city pos13 cit1)
		(g0_in-city apt2 cit2)
		(g1_in-city apt2 cit2)
		(g2_in-city apt2 cit2)
		(g3_in-city apt2 cit2)
		(g0_in-city pos21 cit2)
		(g1_in-city pos21 cit2)
		(g2_in-city pos21 cit2)
		(g3_in-city pos21 cit2)
		(g0_in-city pos22 cit2)
		(g1_in-city pos22 cit2)
		(g2_in-city pos22 cit2)
		(g3_in-city pos22 cit2)
		(g0_in-city pos23 cit2)
		(g1_in-city pos23 cit2)
		(g2_in-city pos23 cit2)
		(g3_in-city pos23 cit2)
	)
	(:goal (and (g0_at obj13 pos22) (g1_at obj12 pos23) (g2_at obj13 pos22) (g3_at obj11 pos21)))
)

; plan
1. (gglobal_load-truck obj11 tru1 pos11)
   deleted: (g0_at obj11 pos11) (g1_at obj11 pos11) (g2_at obj11 pos11) (g3_at obj11 pos11)
   added: (g0_in obj11 tru1) (g1_in obj11 tru1) (g2_in obj11 tru1) (g3_in obj11 tru1)
   goals met: 0 of 4
2. (gglobal_drive-truck tru1 pos11 pos12 cit1)
   deleted: (g0_at tru1 pos11) (g1_at tru1 pos11) (g2_at tru1 pos11) (g3_at tru1 pos11)
   added: (g0_at tru1 pos12) (g1_at tru1 pos12) (g2_at tru1 pos12) (g3_at tru1 pos12)
   goals met: 0 of 4
3. (gglobal_load-truck obj12 tru1 pos12)
   deleted: (g0_at obj12 pos12) (g1_at obj12 pos12) (g2_at obj12 pos12) (g3_at obj12 pos12)
   added: (g0_in obj12 tru1) (g1_in obj12 tru1) (g2_in obj12 tru1) (g3_in obj12 tru1)
   goals met: 0 of 4
4. (gglobal_drive-truck tru1 pos12 pos13 cit1)
   deleted: (g0_at tru1 pos12) (g1_at tru1 pos12) (g2_at tru1 pos12) (g3_at tru1 pos12)
   added: (g0_at tru1 pos13) (g1_at tru1 pos13) (g2_at tru1 pos13) (g3_at tru1 pos13)
   goals met: 0 of 4
5. (gglobal_load-truck obj13 tru1 pos13)
   deleted: (g0_at obj13 pos13) (g1_at obj13 pos13) (g2_at obj13 pos13) (g3_at obj13 pos13)
   added: (g0_in obj13 tru1) (g1_in obj13 tru1) (g2_in obj13 tru1) (g3_in obj13 tru1)
   goals met: 0 of 4
6. (gglobal_drive-truck tru1 pos13 apt1 cit1)
   deleted: (g0_at tru1 pos13) (g1_at tru1 pos13) (g2_at tru1 pos13) (g3_at tru1 pos13)
   added: (g0_at tru1 apt1) (g1_at tru1 apt1) (g2_at tru1 apt1) (g3_at tru1 apt1)
   goals met: 0 of 4
7. (gglobal_unload-truck obj12 tru1 apt1)
   deleted: (g0_in obj12 tru1) (g1_in obj12 tru1) (g2_in obj12 tru1) (g3_in obj12 tru1)
   added: (g0_at obj12 apt1) (g1_at obj12 apt1) (g2_at obj12 apt1) (g3_at obj12 apt1)
   goals met: 0 of 4
8. (gglobal_fly-airplane apn1 apt2 apt1)
   deleted: (g0_at apn1 apt2) (g1_at apn1 apt2) (g2_at apn1 apt2) (g3_at apn1 apt2)
   added: (g0_at apn1 apt1) (g1_at apn1 apt1) (g2_at apn1 apt1) (g3_at apn1 apt1)
   goals met: 0 of 4
9. (gglobal_unload-truck obj11 tru1 apt1)
   deleted: (g0_in obj11 tru1) (g1_in obj11 tru1) (g2_in obj11 tru1) (g3_in obj11 tru1)
   added: (g0_at obj11 apt1) (g1_at obj11 apt1) (g2_at obj11 apt1) (g3_at obj11 apt1)
   goals met: 0 of 4
10. (gglobal_load-airplane obj11 apn1 apt1)
   deleted: (g0_at obj11 apt1) (g1_at obj11 apt1) (g2_at obj11 apt1) (g3_at obj11 apt1)
   added: (g0_in obj11 apn1) (g1_in obj11 apn1) (g2_in obj11 apn1) (g3_in obj11 apn1)
   goals met: 0 of 4
11. (gglobal_load-airplane obj12 apn1 apt1)
   deleted: (g0_at obj12 apt1) (g1_at obj12 apt1) (g2_at obj12 apt1) (g3_at obj12 apt1)
   added: (g0_in obj12 apn1) (g1_in obj12 apn1) (g2_in obj12 apn1) (g3_in obj12 apn1)
   goals met: 0 of 4
12. (gglobal_unload-truck obj13 tru1 apt1)
   deleted: (g0_in obj13 tru1) (g1_in obj13 tru1) (g2_in obj13 tru1) (g3_in obj13 tru1)
   added: (g0_at obj13 apt1) (g1_at obj13 apt1) (g2_at obj13 apt1) (g3_at obj13 apt1)
   goals met: 0 of 4
13. (gglobal_load-airplane obj13 apn1 apt1)
   deleted: (g0_at obj13 apt1) (g1_at obj13 apt1) (g2_at obj13 apt1) (g3_at obj13 apt1)
   added: (g0_in obj13 apn1) (g1_in obj13 apn1) (g2_in obj13 apn1) (g3_in obj13 apn1)
   goals met: 0 of 4
14. (gglobal_fly-airplane apn1 apt1 apt2)
   deleted: (g0_at apn1 apt1) (g1_at apn1 apt1) (g2_at apn1 apt1) (g3_at apn1 apt1)
   added: (g0_at apn1 apt2) (g1_at apn1 apt2) (g2_at apn1 apt2) (g3_at apn1 apt2)
   goals met: 0 of 4
15. (gglobal_unload-airplane obj13 apn1 apt2)
   deleted: (g0_in obj13 apn1) (g1_in obj13 apn1) (g2_in obj13 apn1) (g3_in obj13 apn1)
   added: (g0_at obj13 apt2) (g1_at obj13 apt2) (g2_at obj13 apt2) (g3_at obj13 apt2)
   goals met: 0 of 4
16. (gglobal_drive-truck tru2 pos22 apt2 cit2)
   deleted: (g0_at tru2 pos22) (g1_at tru2 pos22) (g2_at tru2 pos22) (g3_at tru2 pos22)
   added: (g0_at tru2 apt2) (g1_at tru2 apt2) (g2_at tru2 apt2) (g3_at tru2 apt2)
   goals met: 0 of 4
17. (gglobal_unload-airplane obj12 apn1 apt2)
   deleted: (g0_in obj12 apn1) (g1_in obj12 apn1) (g2_in obj12 apn1) (g3_in obj12 apn1)
   added: (g0_at obj12 apt2) (g1_at obj12 apt2) (g2_at obj12 apt2) (g3_at obj12 apt2)
   goals met: 0 of 4
18. (gglobal_load-truck obj13 tru2 apt2)
   deleted: (g0_at obj13 apt2) (g1_at obj13 apt2) (g2_at obj13 apt2) (g3_at obj13 apt2)
   added: (g0_in obj13 tru2) (g1_in obj13 tru2) (g2_in obj13 tru2) (g3_in obj13 tru2)
   goals met: 0 of 4
19. (gglobal_unload-airplane obj11 apn1 apt2)
   deleted: (g0_in obj11 apn1) (g1_in obj11 apn1) (g2_in obj11 apn1) (g3_in obj11 apn1)
   added: (g0_at obj11 apt2) (g1_at obj11 apt2) (g2_at obj11 apt2) (g3_at obj11 apt2)
   goals met: 0 of 4
20. (gglobal_load-truck obj12 tru2 apt2)
   deleted: (g0_at obj12 apt2) (g1_at obj12 apt2) (g2_at obj12 apt2) (g3_at obj12 apt2)
   added: (g0_in obj12 tru2) (g1_in obj12 tru2) (g2_in obj12 tru2) (g3_in obj12 tru2)
   goals met: 0 of 4
21. (gglobal_load-truck obj11 tru2 apt2)
   deleted: (g0_at obj11 apt2) (g1_at obj11 apt2) (g2_at obj11 apt2) (g3_at obj11 apt2)
   added: (g0_in obj11 tru2) (g1_in obj11 tru2) (g2_in obj11 tru2) (g3_in obj11 tru2)
   goals met: 0 of 4
22. (gglobal_drive-truck tru2 apt2 pos21 cit2)
   deleted: (g0_at tru2 apt2) (g1_at tru2 apt2) (g2_at tru2 apt2) (g3_at tru2 apt2)
   added: (g0_at tru2 pos21) (g1_at tru2 pos21) (g2_at tru2 pos21) (g3_at tru2 pos21)
   goals met: 0 of 4
23. (gglobal_unload-truck obj11 tru2 pos21)
   deleted: (g0_in obj11 tru2) (g1_in obj11 tru2) (g2_in obj11 tru2) (g3_in obj11 tru2)
   added: (g0_at obj11 pos21) (g1_at obj11 pos21) (g2_at obj11 pos21) (g3_at obj11 pos21)
   goals met: 1 of 4
24. (gglobal_drive-truck tru2 pos21 pos22 cit2)
   deleted: (g0_at tru2 pos21) (g1_at tru2 pos21) (g2_at tru2 pos21) (g3_at tru2 pos21)
   added: (g0_at tru2 pos22) (g1_at tru2 pos22) (g2_at tru2 pos22) (g3_at tru2 pos22)
   goals met: 1 of 4
25. (gglobal_unload-truck obj13 tru2 pos22)
   deleted: (g0_in obj13 tru2) (g1_in obj13 tru2) (g2_in obj13 tru2) (g3_in obj13 tru2)
   added: (g0_at obj13 pos22) (g1_at obj13 pos22) (g2_at obj13 pos22) (g3_at obj13 pos22)
   goals met: 3 of 4
26. (gglobal_drive-truck tru2 pos22 pos23 cit2)
   deleted: (g0_at tru2 pos22) (g1_at tru2 pos22) (g2_at tru2 pos22) (g3_at tru2 pos22)
   added: (g0_at tru2 pos23) (g1_at tru2 pos23) (g2_at tru2 pos23) (g3_at tru2 pos23)
   goals met: 3 of 4
27. (gglobal_unload-truck obj12 tru2 pos23)
   deleted: (g0_in obj12 tru2) (g1_in obj12 tru2) (g2_in obj12 tru2) (g3_in obj12 tru2)
   added: (g0_at obj12 pos23) (g1_at obj12 pos23) (g2_at obj12 pos23) (g3_at obj12 pos23)
   goals met: 4 of 4
